IDEA Open Model
IdeaBeamImportSettings Class
Compatible with IDEA StatiCa Beta 20.0
 Represents settings of improt options into Idea Connections
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Beam.IdeaBeamImportSettings
 Namespace: IdeaRS.OpenModel.Beam
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class IdeaBeamImportSettings
Public Class IdeaBeamImportSettings
The IdeaBeamImportSettings type exposes the following members.
Constructors
Name | Description
IdeaBeamImportSettings
 Constructor - it sets default values
Top
Properties
Name | Description
BeamFileName
 Gets or sets the name of the Beam project
CanChangeDesignCodeInWizard
 Can change design code in Wizard
DesignCode
 Gets or sets the Design Code
ExportAllLinearCombination
 All linear combination will be exported to IDEA connection
UserWizardBrand
 Set user Wizard Brand
UseWizard
 Open import wizard window
Top
See Also
Reference
IdeaRS.OpenModel.Beam Namespace